Merge pull request #15 from zhouhao/adoring-nobel
convert architecture diagrams to Mermaid.js format across all documen…
